<a href="https://colab.research.google.com/github/FernandoLajus/OECD/blob/main/OECD%20immigration.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv ('/content/DIOC_2015_16_File_A_1.csv', encoding = 'UTF-8')

In [10]:
df = pd.read_csv ('/content/DIOC_2015_16_File_A_1.csv', encoding = 'UTF-8', usecols= ['country','sex','national','fborn','number'])

In [11]:
df.head()

  country  sex  national  fborn  number
0     AUS    1         0      1    7501
1     AUS    1         1      1    8068
2     AUS    1        99      1     392
3     AUS    1         0      1    1867
4     AUS    1         0      1    4282

In [13]:
df.shape

(15549, 5)